@afzaalmd According to your screenshot I tried to reproduce the flow and I think there is a misinterpretation of what Terraform does when planning the change:

**Step 1** Creation of a unmanaged Directory with a subaccount that has the directory as parent. The attribute `beta_enabled` is set to false:

The Terraform configuration looks like this
```terraform
resource "btp_directory" "parent" {
  name        = "my-parent-directory"
  description = "This is a unmanaged parent directory."
}

resource "btp_subaccount" "my_project" {
  name         = "Retest Parent Feature"
  subdomain    = "my-project-parent-feature"
  region       = "us10"
  beta_enabled = false
  parent_id    = btp_directory.parent.id
}
```

Applying this change results in a state for the subaccount that looks like this (including the read-only attributes)

```bash
# btp_subaccount.my_project:
resource "btp_subaccount" "my_project" {
    beta_enabled    = false
    created_by      = "xyz@sap.com"
    created_date    = "2025-07-02T08:43:49Z"
    description     = null
    id              = "93..."
    last_modified   = "2025-07-02T08:44:18Z"
    name            = "Retest Parent Feature"
    parent_features = [
        "DEFAULT",
    ]
    parent_id       = "15..."
    region          = "us10"
    state           = "OK"
    subdomain       = "my-project-parent-feature"
    usage           = "UNSET"
}
```

A consequent `terraform plan` does not show any drift:

```bash
btp_directory.parent: Refreshing state... [id=15...
btp_subaccount.my_project: Refreshing state... [id=93...]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

Changing the attribute `beta_enabled` to `true` result in the following execution plan:

```bash
btp_directory.parent: Refreshing state... [id=15...]
btp_subaccount.my_project: Refreshing state... [id=93...]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # btp_subaccount.my_project will be updated in-place
  ~ resource "btp_subaccount" "my_project" {
      ~ beta_enabled    = false -> true
      ~ created_by      = "christian.lechner@sap.com" -> (known after apply)
      ~ created_date    = "2025-07-02T08:43:49Z" -> (known after apply)
        id              = "93..."
      ~ last_modified   = "2025-07-02T08:44:18Z" -> (known after apply)
        name            = "Retest Parent Feature"
      ~ parent_features = [
          - "DEFAULT",
        ] -> (known after apply)
      ~ state           = "OK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

You can see that:

- the resource `btp_directiry` remains unchanged as intended
- the attribute `beta_enabled` gets changed in-place as intended
- All **read-only** attributes of the resource (see [btp_subaccount (Resource) - Read-Only])(https://registry.terraform.io/providers/SAP/btp/latest/docs/resources/subaccount) that you cannot change or provide but are returned by the platform  get marked as `(known after apply)`.

The `terraform plan` command does not call the APIs of SAP BTP and, hence, does not know if read-only attributes get potentially changed or not after the `terraform apply` as it does not know about the semantics of the field. Consequently it marks them as changed (or in case of the entry of the list of parent features as removed). As you can see Terraform also implies that the `created_date` might be changed, which is misleading, but caused by the generic approach of Terraform for read-only fields. This behavior is okay for read-only fields and the fields will be changed in accordance to the API response where required. In case of the `parent_features` there is also no impact to the parent as this one is not  touched by the change.

Applying the change leads to the following state:

```bash
# btp_subaccount.my_project:
resource "btp_subaccount" "my_project" {
    beta_enabled    = true
    created_by      = "christian.lechner@sap.com"
    created_date    = "2025-07-02T08:43:49Z"
    description     = null
    id              = "93..."
    last_modified   = "2025-07-02T09:04:03Z"
    name            = "Retest Parent Feature"
    parent_features = [
        "DEFAULT",
    ]
    parent_id       = "15..."
    region          = "us10"
    state           = "OK"
    subdomain       = "my-project-parent-feature"
    usage           = "UNSET"
}
```

This state contains the field as expected.

Summary: In general in any *in-place update* the *read-only* fields are marked as changed/deleted depending on their type and are marked as `known after apply`.  This behavior of Terraform is correct and as expected. The read-only fields are usually nothing you should worry about when analyzing the `terraform plan` file.

Does this address your doubts?